Revit 2026 API

# ViewFamilyTypeIsValidDefaultTemplate Method

---

Verifies that the input can be used as a default template for this view type.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsValidDefaultTemplate(
	ElementId templateId
)
```
```vb
Public Function IsValidDefaultTemplate (
	templateId As ElementId
) As Boolean
```
```cpp
public:
bool IsValidDefaultTemplate(
	ElementId^ templateId
)
```
```fsharp
member IsValidDefaultTemplate :
        templateId : ElementId -> bool
```

#### Parameters

templateId ElementId
     Id to be validated as default template.

#### Return Value

Boolean True if %templateId% is valid as default template, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

The id must represent a template view that is compatible with this view type, or InvalidElementId.

#### Reference

ViewFamilyType Class

Autodesk.Revit.DB Namespace